000_РОЗНИЦА_ЦЕНТР/src/DocumentJournals/КассовыеДокументы/КассовыеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>КассовыеДокументы</name>
  <registeredDocuments>Document.ПриходныйКассовыйОрдер</registeredDocuments>
  <registeredDocuments>Document.РасходныйКассовыйОрдер</registeredDocuments>
  <columns>
    <name>Касса</name>
  </columns>
  <columns>
    <name>КассаККМ</name>
  </columns>
  <columns>
    <name>Комментарий</name>
  </columns>
  <columns>
    <name>Контрагент</name>
  </columns>
  <columns>
    <name>НомерОрдера</name>
  </columns>
  <columns>
    <name>Организация</name>
  </columns>
  <columns>
    <name>Ответственный</name>
  </columns>
  <columns>
    <name>Приход</name>
  </columns>
  <columns>
    <name>Расход</name>
  </columns>
  <columns>
    <name>ХозяйственнаяОперация</name>
  </columns>
</mdclass:DocumentJournal>

000_РОЗНИЦА_ЦЕНТР/src/DocumentJournals/КассовыеДокументы/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация"
		, ?(ОбменДаннымиПовтИсп.ЭтоГлавныйУзел()
			, Неопределено
			, ПараметрыСеанса.ТекущаяОрганизация));

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПользовательИзменилТекущуюОрганизацию" Тогда

		Если НЕ Параметр.Организация = Список.Параметры.Элементы.Найти("Организация").Значение Тогда

			Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметр.Организация);
			Элементы.Список.Обновить();

		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры
	
#КонецОбласти

&НаКлиенте
Процедура ЖурналРегистрацииКассовыхДокументов(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаНачала"   , НачалоМесяца(ТекущаяДата()));
	ПараметрыФормы.Вставить("ДатаОкончания", КонецМесяца(ТекущаяДата()));

	Если НЕ Элементы.Список.ТекущиеДанные = Неопределено Тогда

		ПараметрыФормы.Вставить("Касса", Элементы.Список.ТекущиеДанные.Касса);

	КонецЕсли;

	ОткрытьФорму("ЖурналДокументов.КассовыеДокументы.Форма.ФормаЖурналРегистрации", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект);

КонецПроцедуры
